#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураПараметров = ПервоначальноеСканирование();
	
	Если СтруктураПараметров.ФайловыйВариант Тогда
		Сообщить("Представления собираются только для клиент-серверного варианта базы");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(DBSrcFullname) Тогда
		DBSrcFullname = СтруктураПараметров.ИмяИнформационнойБазы;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ServerName) Тогда
		ServerName = "localhost";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(DBDstFullname) Тогда
		DBDstFullname = "TempDb";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(UID) Тогда
		UID = "sa";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(PWD) Тогда
		PWD = "qwerty";
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ДобавитьВсеПоляВоView) Тогда
	ДобавитьВсеПоляВоView = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СоздатьView(Команда)
	СтруктураПараметров = Новый Структура("ВыбратьДанныеИзView,ДобавитьВсеПоляВоView,WindowsAuth,DBDstFullname,DBSrcFullname,ServerName,UID,PWD,ВыбратьДанныеИзView"
	,ВыбратьДанныеИзView,ДобавитьВсеПоляВоView,WindowsAuth,DBDstFullname,DBSrcFullname,ServerName,UID,PWD,ВыбратьДанныеИзView); 
	СоздатьViewServerНаСервере(СтруктураПараметров);	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура  СоздатьViewServerНаСервере(СтруктураПараметров)
	
	Обработка = РеквизитФормыВЗначение("Объект");

	Обработка.СоздатьViewServer(СтруктураПараметров);	
	
КонецПроцедуры


&НаКлиенте
Процедура WindowsAuthПриИзменении(Элемент)
	Элементы.UID.Доступность = НЕ WindowsAuth;
	Элементы.PWD.Доступность = НЕ WindowsAuth;
КонецПроцедуры

&НаСервере
Функция ПервоначальноеСканирование()
	СтруктураПараметров = Новый Структура(); 
	Соединения = ПолучитьСоединенияИнформационнойБазы();
	Для каждого СоединениеИнформационнойБазы Из Соединения Цикл
		
		Если СоединениеИнформационнойБазы.Пользователь.Имя = ИмяПользователя() И  (СоединениеИнформационнойБазы.ИмяПриложения="1CV8" ИЛИ СоединениеИнформационнойБазы.ИмяПриложения="1CV8C")  Тогда
			Если Лев(СтрокаСоединенияИнформационнойБазы(),5)="File=" Тогда
				СтруктураПараметров.Вставить("ФайловыйВариант",Истина);
			Иначе
				СтруктураПараметров.Вставить("ФайловыйВариант",Ложь);
				
				Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы(), "Srvr=");
				ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы(), Поиск1 + 6);
				ИмяСервераИБ = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
				// теперь ищем имя базы
				Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы(), "Ref=");
				ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы(), Поиск1 + 5);
				ИмяИнформационнойБазы = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
				
				СтруктураПараметров.Вставить("ИмяСервераИБ",ИмяСервераИБ);
				СтруктураПараметров.Вставить("ИмяИнформационнойБазы",ИмяИнформационнойБазы);
			КонецЕсли;    
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

